app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "tes1"], ["body", "sdfsdffdsafsdfsdf"], ["created_at", "2022-01-23 04:06:36.607311"], ["updated_at", "2022-01-23 04:06:36.607311"], ["status", "public"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-01-23 04:04:41.652620"], ["status", "public"], ["id", 1]]